tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "libgit2"
brew "bat"
brew "glib"
brew "cairo"
brew "chroma"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "fzf"
brew "node"
brew "python@3.12"
brew "jupyterlab", link: false
brew "libheif"
brew "netpbm"
brew "nmap"
brew "nvm"
brew "pmix"
brew "open-mpi"
brew "powerlevel10k"
brew "pyenv"
brew "pygments", link: false
brew "r"
brew "stow"
brew "sundials"
brew "tree"
brew "typst"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
cask "aerospace"
cask "amethyst"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "iterm2"
cask "mactex"
cask "mathpix-snipping-tool"
cask "raycast"
cask "scroll-reverser"
cask "visual-studio-code"
cask "wezterm"
vscode "1000ch.svgo"
vscode "adpyke.codesnap"
vscode "ardenivanov.svelte-intellisense"
vscode "azemoh.one-monokai"
vscode "bbenoist.nix"
vscode "codeium.codeium"
vscode "dqisme.sync-scroll"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "fabiospampinato.vscode-highlight"
vscode "fabiospampinato.vscode-monokai-night"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-rename-tag"
vscode "gitlab.gitlab-workflow"
vscode "gruntfuggly.todo-tree"
vscode "guyutongxue.cpp-reference"
vscode "htmlhint.vscode-htmlhint"
vscode "ivan-bocharov.stan-vscode"
vscode "james-yu.latex-workshop"
vscode "mathworks.language-matlab"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "mxthevs.one-dark-pro-monokai-darker-reloaded"
vscode "myriad-dreamin.tinymist"
vscode "nvarner.typst-lsp"
vscode "pkief.material-icon-theme"
vscode "quarto.quarto"
vscode "rdebugger.r-debugger"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "ritwickdey.liveserver"
vscode "s3gf4ult.monokai-vibrant"
vscode "sidthesloth.html5-boilerplate"
vscode "simonsiefke.svg-preview"
vscode "standard.vscode-standard"
vscode "stkb.rewrap"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tal7aouy.theme"
vscode "tamasfe.even-better-toml"
vscode "tianyishi.rmarkdown"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "wenfangdu.snippet-generator"
vscode "withfig.fig"
